Функция ВнутрФункция(число, Делитель)
    КолвоЧисел = Цел((число - 1) / Делитель);
    Возврат Цел((Делитель * КолвоЧисел * (КолвоЧисел + 1)) / 2);
КонецФункции

Функция Задача1(число) Экспорт
    Возврат ВнутрФункция(число, 3) + ВнутрФункция(число, 5) - ВнутрФункция(число, 15);
КонецФункции

Функция Задача30() Экспорт
    МаксГраница = 6 * 9 * 9 * 9 * 9 * 9;
    Сумма = 0;
    
    Для Число = 2 По МаксГраница Цикл
        ТекЧисло = Число;
        СуммаСтеп = 0;
        
        Пока ТекЧисло > 0 Цикл
            Цифра = ТекЧисло % 10;
            Степень = Цифра * Цифра * Цифра * Цифра * Цифра;
            СуммаСтеп = СуммаСтеп + Степень;
            ТекЧисло = Цел(ТекЧисло / 10);
        КонецЦикла;
        
        Если Число = СуммаСтеп Тогда
            Сумма = Сумма + Число;
        КонецЕсли;
    КонецЦикла;
    
    Возврат Сумма;
КонецФункции